<a href="https://colab.research.google.com/github/sungurula/titanic_with_KNeighbors/blob/master/titanic_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
from google.colab import files

In [0]:
import matplotlib.pyplot as plt

In [0]:
import numpy as np

In [0]:
uploaded =files.upload()

Saving train.csv to train.csv

In [0]:
import io


df3 = pd.read_csv(io.BytesIO(uploaded["train.csv"]))

In [0]:
df3.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [0]:
df3.info()    # here we are looking at the column names and numbers and their datatypes to decide
              #what process we will apply.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [0]:
#first of all in our data we have unregistered data points.do we wanna get rid of them now or later. now looks good so splitting will be made with machine learning part.
#1-) ı need to figure out a way with the nan datas. so ı place mean value when it comes to putting them in. 
#2-) then ı will convert categorical attributes into numbers.
#3-)then ı will scale them between 0 and 1.
#4-)and at last ı will use imputer the replace the nan values with mean values.!!!!(would scaling change the values of the survived??? Yes don t need to scale them next time if this is a classifier porject)
#5-)ı will split train and test datasets


#'''''' ı got rid of the cabin and name and Ticket features because it has so little data in Cabin and name feature is irrelevant.
#''''''right now ı will convert words to numbers. which are "Sex and Embarked" features.
#''''''to change the categorical values of sex into binary ı will replace sex column with male and female column.how to create random lists???
#'''''' ı could change the categorical values into numeric ones and actually ı wrote my own function for it
#when ı finish this project ı will make it a real usable function and maybe put it on github.
# ı have scaled the values with standardScaler.

In [0]:
df_dropped = df3.drop(["Cabin","Name","Ticket"],axis = 1)

In [0]:
df_dropped.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [0]:
Sex = df_dropped["Sex"]

In [0]:
sex_list = Sex.values.tolist()

In [0]:
male = []
female =[]   #empty lists to be filled with ones and zeros

In [0]:
for i in range(len(sex_list)):
  if sex_list[i] == "male" :
    male.append(1) 
    female.append(0)
  
                                           #the problem is with the "male" value that is inside the pandas dataframe.i will try it
                                           # with list method. i ll turn Sex into a list.
  else: 
    male.append(0)  
    female.append(1)

In [0]:
df_dropped["male"] = male
df_dropped["female"] = female

In [0]:
df_dropped.head()

   PassengerId  Survived  Pclass     Sex  ...     Fare  Embarked  male  female
0            1         0       3    male  ...   7.2500         S     1       0
1            2         1       1  female  ...  71.2833         C     0       1
2            3         1       3  female  ...   7.9250         S     0       1
3            4         1       1  female  ...  53.1000         S     0       1
4            5         0       3    male  ...   8.0500         S     1       0

[5 rows x 11 columns]

In [0]:
df_dropped_sex = df_dropped.drop(["Sex"],axis =1 )

In [0]:
df_dropped_sex.head()

   PassengerId  Survived  Pclass   Age  ...     Fare  Embarked  male female
0            1         0       3  22.0  ...   7.2500         S     1      0
1            2         1       1  38.0  ...  71.2833         C     0      1
2            3         1       3  26.0  ...   7.9250         S     0      1
3            4         1       1  35.0  ...  53.1000         S     0      1
4            5         0       3  35.0  ...   8.0500         S     1      0

[5 rows x 10 columns]

In [0]:
Embarked = df_dropped_sex["Embarked"]

embarked_list = Embarked.values.tolist()

In [0]:
S =[]
C = []
Q = []

In [0]:
for i in range(len(embarked_list)):
  if embarked_list[i] == "S" :
    S.append(1) 
    C.append(0)
    Q.append(0)
  
                                          
  elif embarked_list[i] == "C":
    
    S.append(0)  
    C.append(1)
    Q.append(0)
  else:
    S.append(0)
    C.append(0)
    Q.append(1)

In [0]:
df_dropped_sex["S"] = S
df_dropped_sex["C"] = C
df_dropped_sex["Q"] = Q

In [0]:
df_dropped_sex.head()

   PassengerId  Survived  Pclass   Age  SibSp  ...  male  female  S  C  Q
0            1         0       3  22.0      1  ...     1       0  1  0  0
1            2         1       1  38.0      1  ...     0       1  0  1  0
2            3         1       3  26.0      0  ...     0       1  1  0  0
3            4         1       1  35.0      1  ...     0       1  1  0  0
4            5         0       3  35.0      0  ...     1       0  1  0  0

[5 rows x 13 columns]

In [0]:
df = df_dropped_sex.drop(["Embarked"],axis = 1)

In [0]:
df.head()

   PassengerId  Survived  Pclass   Age  SibSp  ...  male  female  S  C  Q
0            1         0       3  22.0      1  ...     1       0  1  0  0
1            2         1       1  38.0      1  ...     0       1  0  1  0
2            3         1       3  26.0      0  ...     0       1  1  0  0
3            4         1       1  35.0      1  ...     0       1  1  0  0
4            5         0       3  35.0      0  ...     1       0  1  0  0

[5 rows x 12 columns]

In [0]:
from sklearn.preprocessing import StandardScaler

In [0]:
scaler = StandardScaler()

scaled_df = scaler.fit_transform(df)

In [0]:
scaled_df = pd.DataFrame(scaled_df,columns=["PassengerId",	"Survived",	"Pclass",	"Age",	"SibSp",	"Parch",	"Fare",	"male",	"female",	"S",	"C",	"Q"])

In [0]:
scaled_df.head()

   PassengerId  Survived    Pclass  ...         S         C         Q
0    -1.730108 -0.789272  0.827377  ...  0.619306 -0.482043 -0.311914
1    -1.726220  1.266990 -1.566107  ... -1.614710  2.074505 -0.311914
2    -1.722332  1.266990  0.827377  ...  0.619306 -0.482043 -0.311914
3    -1.718444  1.266990 -1.566107  ...  0.619306 -0.482043 -0.311914
4    -1.714556 -0.789272  0.827377  ...  0.619306 -0.482043 -0.311914

[5 rows x 12 columns]

In [0]:
scaled_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null float64
Survived       891 non-null float64
Pclass         891 non-null float64
Age            714 non-null float64
SibSp          891 non-null float64
Parch          891 non-null float64
Fare           891 non-null float64
male           891 non-null float64
female         891 non-null float64
S              891 non-null float64
C              891 non-null float64
Q              891 non-null float64
dtypes: float64(12)
memory usage: 83.6 KB

only the age need to be imputed mean values.

In [0]:
Age = scaled_df["Age"]

Age_last = Age.fillna( 2.174187e-16)

In [0]:
Age_dropped = scaled_df.drop(["Age"],axis=1)

In [0]:
age = Age_last.values.tolist()

In [0]:
Age_dropped["Age"] = age

In [0]:
dflast = Age_dropped

In [0]:
dflast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null float64
Survived       891 non-null float64
Pclass         891 non-null float64
SibSp          891 non-null float64
Parch          891 non-null float64
Fare           891 non-null float64
male           891 non-null float64
female         891 non-null float64
S              891 non-null float64
C              891 non-null float64
Q              891 non-null float64
Age            891 non-null float64
dtypes: float64(12)
memory usage: 83.6 KB

In [0]:
#okkay finito. veri preprocessing tamamlandı

In [0]:
 dflast.to_csv("titanic_cleaned.csv")